hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_pdma_regs.h
/*
 * ABLEND_MODE (RW)
 *
 * Alpha Blending Mode
 * 0: SKBlendMode_Clear (If PS1_CTRL[BKGNDCL4CLR] is asserted, use PS1_BKGRND color to fill the range determined by PS1, else fill the range determined by PS1 with zero);
 * 1: SKBlendMode_Src ;
 * 2: SKBlendMode_Dst
 * 3: SKBlendMode_SrcOver
 * 4: SKBlendMode_DstOver
 * 5: SKBlendMode_SrcIn
 * 6: SKBlendMode_DstIn
 * 7: SKBlendMode_SrcOut
 * 8: SKBlendMode_DstOut
 * 9: SKBlendMode_SrcATop
 * 10: SKBlendMode_DstATop
 * 11: SKBlendMode_Xor
 * 12: SKBlendMode_Plus    (The conventional belding mode)
 * 13: SKBlendMode_Modulate
 * 14: SRC org
 * 15: DST org
 * Others: Reserved.
 */
#define PDMA_OUT_CTRL_ABLEND_MODE_MASK (0xF00U)
#define PDMA_OUT_CTRL_ABLEND_MODE_SHIFT (8U)
#define PDMA_OUT_CTRL_ABLEND_MODE_SET(x) (((uint32_t)(x) << PDMA_OUT_CTRL_ABLEND_MODE_SHIFT) & PDMA_OUT_CTRL_ABLEND_MODE_MASK)
#define PDMA_OUT_CTRL_ABLEND_MODE_GET(x) (((uint32_t)(x) & PDMA_OUT_CTRL_ABLEND_MODE_MASK) >> PDMA_OUT_CTRL_ABLEND_MODE_SHIFT)

/*
 * NORM_OUT (RW)
 *
 * Asserted to normalize the output color channels with alpha channels
 */
#define PDMA_OUT_CTRL_NORM_OUT_MASK (0x80U)
#define PDMA_OUT_CTRL_NORM_OUT_SHIFT (7U)
#define PDMA_OUT_CTRL_NORM_OUT_SET(x) (((uint32_t)(x) << PDMA_OUT_CTRL_NORM_OUT_SHIFT) & PDMA_OUT_CTRL_NORM_OUT_MASK)
#define PDMA_OUT_CTRL_NORM_OUT_GET(x) (((uint32_t)(x) & PDMA_OUT_CTRL_NORM_OUT_MASK) >> PDMA_OUT_CTRL_NORM_OUT_SHIFT)

/*
 * FORMAT (RW)
 *
 * Output buffer format.
 * 0x0 ARGB8888 - 32-bit pixles, byte sequence as B,G,R,A
 * 0xE RGB565 - 16-bit pixels, byte sequence as B,R
 * 0x12 UYVY1P422 - 16-bit pixels (1-plane , byte sequence as U0,Y0,V0,Y1)
 */
#define PDMA_OUT_CTRL_FORMAT_MASK (0x3FU)
#define PDMA_OUT_CTRL_FORMAT_SHIFT (0U)
#define PDMA_OUT_CTRL_FORMAT_SET(x) (((uint32_t)(x) << PDMA_OUT_CTRL_FORMAT_SHIFT) & PDMA_OUT_CTRL_FORMAT_MASK)
#define PDMA_OUT_CTRL_FORMAT_GET(x) (((uint32_t)(x) & PDMA_OUT_CTRL_FORMAT_MASK) >> PDMA_OUT_CTRL_FORMAT_SHIFT)

/* Bitfield definition for register: OUT_BUF */
/*
 * ADDR (RW)
 *
 * Current address pointer for the output frame buffer. The address can have any byte alignment. 64B alignment is recommended for optimal performance.
 */
#define PDMA_OUT_BUF_ADDR_MASK (0xFFFFFFFFUL)
#define PDMA_OUT_BUF_ADDR_SHIFT (0U)
#define PDMA_OUT_BUF_ADDR_SET(x) (((uint32_t)(x) << PDMA_OUT_BUF_ADDR_SHIFT) & PDMA_OUT_BUF_ADDR_MASK)
#define PDMA_OUT_BUF_ADDR_GET(x) (((uint32_t)(x) & PDMA_OUT_BUF_ADDR_MASK) >> PDMA_OUT_BUF_ADDR_SHIFT)

/* Bitfield definition for register: OUT_PITCH */
/*
 * BYTELEN (RW)
 *
 * Indicates the number of bytes in memory between two vertically adjacent pixels.
 */
#define PDMA_OUT_PITCH_BYTELEN_MASK (0xFFFFU)
#define PDMA_OUT_PITCH_BYTELEN_SHIFT (0U)
#define PDMA_OUT_PITCH_BYTELEN_SET(x) (((uint32_t)(x) << PDMA_OUT_PITCH_BYTELEN_SHIFT) & PDMA_OUT_PITCH_BYTELEN_MASK)
#define PDMA_OUT_PITCH_BYTELEN_GET(x) (((uint32_t)(x) & PDMA_OUT_PITCH_BYTELEN_MASK) >> PDMA_OUT_PITCH_BYTELEN_SHIFT)

/* Bitfield definition for register: OUT_LRC */
/*
 * Y (RW)
 *
 * This field indicates the lower right Y-coordinate (in pixels) of the output frame buffer.
 * The value is the height of the output image size.
 */
#define PDMA_OUT_LRC_Y_MASK (0x3FFF0000UL)
#define PDMA_OUT_LRC_Y_SHIFT (16U)
#define PDMA_OUT_LRC_Y_SET(x) (((uint32_t)(x) << PDMA_OUT_LRC_Y_SHIFT) & PDMA_OUT_LRC_Y_MASK)
#define PDMA_OUT_LRC_Y_GET(x) (((uint32_t)(x) & PDMA_OUT_LRC_Y_MASK) >> PDMA_OUT_LRC_Y_SHIFT)

/*
 * X (RW)
 *
 * This field indicates the lower right X-coordinate (in pixels) of the output frame buffer.
 * Should be the width of the output image size.
 */
#define PDMA_OUT_LRC_X_MASK (0x3FFFU)
#define PDMA_OUT_LRC_X_SHIFT (0U)
#define PDMA_OUT_LRC_X_SET(x) (((uint32_t)(x) << PDMA_OUT_LRC_X_SHIFT) & PDMA_OUT_LRC_X_MASK)
#define PDMA_OUT_LRC_X_GET(x) (((uint32_t)(x) & PDMA_OUT_LRC_X_MASK) >> PDMA_OUT_LRC_X_SHIFT)

/* Bitfield definition for register of struct array OUT_PS: ULC */
/*
 * Y (RW)
 *
 * This field indicates the upper left Y-coordinate (in pixels) of the processed surface in the output frame buffer.
 */
#define PDMA_OUT_PS_ULC_Y_MASK (0x3FFF0000UL)
#define PDMA_OUT_PS_ULC_Y_SHIFT (16U)
#define PDMA_OUT_PS_ULC_Y_SET(x) (((uint32_t)(x) << PDMA_OUT_PS_ULC_Y_SHIFT) & PDMA_OUT_PS_ULC_Y_MASK)
#define PDMA_OUT_PS_ULC_Y_GET(x) (((uint32_t)(x) & PDMA_OUT_PS_ULC_Y_MASK) >> PDMA_OUT_PS_ULC_Y_SHIFT)

/*
 * X (RW)
 *
 * This field indicates the upper left X-coordinate (in pixels) of the processed surface in the output frame buffer.
 */
#define PDMA_OUT_PS_ULC_X_MASK (0x3FFFU)
#define PDMA_OUT_PS_ULC_X_SHIFT (0U)
#define PDMA_OUT_PS_ULC_X_SET(x) (((uint32_t)(x) << PDMA_OUT_PS_ULC_X_SHIFT) & PDMA_OUT_PS_ULC_X_MASK)
#define PDMA_OUT_PS_ULC_X_GET(x) (((uint32_t)(x) & PDMA_OUT_PS_ULC_X_MASK) >> PDMA_OUT_PS_ULC_X_SHIFT)

/* Bitfield definition for register of struct array OUT_PS: LRC */
/*
 * Y (RW)
 *
 * This field indicates the lower right Y-coordinate (in pixels) of the processed surface in the output frame buffer.
 */
#define PDMA_OUT_PS_LRC_Y_MASK (0x3FFF0000UL)
#define PDMA_OUT_PS_LRC_Y_SHIFT (16U)
#define PDMA_OUT_PS_LRC_Y_SET(x) (((uint32_t)(x) << PDMA_OUT_PS_LRC_Y_SHIFT) & PDMA_OUT_PS_LRC_Y_MASK)
#define PDMA_OUT_PS_LRC_Y_GET(x) (((uint32_t)(x) & PDMA_OUT_PS_LRC_Y_MASK) >> PDMA_OUT_PS_LRC_Y_SHIFT)

/*
 * X (RW)
 *
 * This field indicates the lower right X-coordinate (in pixels) of the processed surface in the output frame buffer.
 */
#define PDMA_OUT_PS_LRC_X_MASK (0x3FFFU)
#define PDMA_OUT_PS_LRC_X_SHIFT (0U)
#define PDMA_OUT_PS_LRC_X_SET(x) (((uint32_t)(x) << PDMA_OUT_PS_LRC_X_SHIFT) & PDMA_OUT_PS_LRC_X_MASK)
#define PDMA_OUT_PS_LRC_X_GET(x) (((uint32_t)(x) & PDMA_OUT_PS_LRC_X_MASK) >> PDMA_OUT_PS_LRC_X_SHIFT)

/* Bitfield definition for register of struct array PS: CTRL */
/*
 * PL_ONLY_BLENDOP (RW)
 *
 * 1: For those pixels that are this plane-only, use the colcor values and alpha values directly as blender output for un-normalized outputs configurations.
 * 0: For those pixels that are this plane-only, the operations are determined by other operation configurations.
 */
#define PDMA_PS_CTRL_PL_ONLY_BLENDOP_MASK (0x1000000UL)
#define PDMA_PS_CTRL_PL_ONLY_BLENDOP_SHIFT (24U)
#define PDMA_PS_CTRL_PL_ONLY_BLENDOP_SET(x) (((uint32_t)(x) << PDMA_PS_CTRL_PL_ONLY_BLENDOP_SHIFT) & PDMA_PS_CTRL_PL_ONLY_BLENDOP_MASK)
#define PDMA_PS_CTRL_PL_ONLY_BLENDOP_GET(x) (((uint32_t)(x) & PDMA_PS_CTRL_PL_ONLY_BLENDOP_MASK) >> PDMA_PS_CTRL_PL_ONLY_BLENDOP_SHIFT)

